In [5]:
from sqlalchemy import *

password = "?eMc2GnHzV"
db_name = "agehr"
andrewid = "agehr"
server_name = "debprodserver.postgres.database.azure.com"
db_url = f"postgresql://" + andrewid + ":" + password + "@" + server_name + ":5432/" + db_name
engine = create_engine(db_url)

In [6]:
%load_ext sql
%sql engine

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%%sql

--- DROP TABLE IF EXISTS Institutions CASCADE;

CREATE TABLE Institutions (
   institution_id INT PRIMARY KEY, --- 6-digit code
   name TEXT NOT NULL, 
   accredagency TEXT, ---accrediting agency
   control INT CHECK (control IN (1, 2, 3)), --- 1=Public, 2=Private nonprofit, 3=Proprietary
   CCbasic INT CHECK (CCbasic <= 33), --- Carnegie classifier
   region INT CHECK (region BETWEEN 0 AND 9),
   csba INT, --- Core Based Statistical Area
   cba INT, --- Combined Statistical Area
   county_fips INT, --- County FIPS code
   city TEXT,
   state TEXT CHECK (LENGTH(state) = 2),
   address TEXT,
   zip TEXT,
   latitude FLOAT,
   longitude FLOAT
);

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

++
||
++
++

In [ ]:
%%sql

--- DROP TABLE IF EXISTS Students CASCADE;
--- DROP TABLE IF EXISTS Financials CASCADE;
--- DROP TABLE IF EXISTS Academics CASCADE;


CREATE TABLE Students (
   institution_id INT REFERENCES Institutions(institution_id),
   year INT CHECK (year > 0 AND year <= EXTRACT(YEAR FROM CURRENT_DATE)),
   adm_rate FLOAT CHECK (adm_rate >= 0 and adm_rate <= 1), 
   num_students INT CHECK (num_students >= 0),  
   act FLOAT CHECK (act >= 1 and act <= 36), 
   cdr2 FLOAT CHECK (cdr2 >= 0 and cdr2 <= 1),
   cdr3 FLOAT CHECK (cdr3 >= 0 and cdr3 <= 1), 
   PRIMARY KEY (institution_id, year)
);

CREATE TABLE Financials (
   institution_id INT REFERENCES Institutions(institution_id),
   year INT CHECK (year > 0 AND year <= EXTRACT(YEAR FROM CURRENT_DATE)),
   tuitionfee_in INT CHECK (tuitionfee_in >= 0), 
   tuitionfee_out INT CHECK (tuitionfee_out >= 0), 
   tuitionfee_prog INT CHECK (tuitionfee_prog >= 0), 
   tuitfte INT CHECK (tuitfte >= 0), 
   avgfacsal INT CHECK (avgfacsal >= 0), 
   PRIMARY KEY (institution_id, year)
);

CREATE TABLE Academics (
   institution_id INT REFERENCES Institutions(institution_id),
   year INT CHECK (year > 0 AND year <= EXTRACT(YEAR FROM CURRENT_DATE)),
   preddeg INT CHECK (preddeg BETWEEN 0 AND 4), 
   highdeg INT CHECK (highdeg BETWEEN 0 AND 4), 
   stufacr FLOAT CHECK (stufacr >= 0), 
   PRIMARY KEY (institution_id, year)
);

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

++
||
++
++

In [19]:
%%sql
SELECT * FROM Institutions LIMIT 5;

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

5 rows affected.

+----------------+-------------------------------------+---------------------------------------------------------------------+---------+---------+--------+-------+-----+-------------+------------+-------+--------------------------------+------------+-----------+------------+
| institution_id |                 name                |                             accredagency                            | control | ccbasic | region |  csba | cba | county_fips |    city    | state |            address             |    zip     |  latitude | longitude  |
+----------------+-------------------------------------+---------------------------------------------------------------------+---------+---------+--------+-------+-----+-------------+------------+-------+--------------------------------+------------+-----------+------------+
|     100654     |       Alabama A & M University      | Southern Association of Colleges and Schools Commission on Colleges |    1    |    18   |   5    | 26620 | 290 |     1089    |   Normal   |   AL  |      4900 Meridian Street      |   35762    | 34.783368 | -86.568502 |
|     100663     | University of Alabama at Birmingham | Southern Association of Colleges and Schools Commission on Colleges |    1    |    15   |   5    | 13820 | 142 |     1073    | Birmingham |   AL  | Administration Bldg Suite 1070 | 35294-0110 | 33.505697 | -86.799345 |
|     100690     |          Amridge University         | Southern Association of Colleges and Schools Commission on Colleges |    2    |    20   |   5    | 33860 | 388 |     1101    | Montgomery |   AL  |         1200 Taylor Rd         | 36117-3553 | 32.362609 | -86.17401  |
|     100706     | University of Alabama in Huntsville | Southern Association of Colleges and Schools Commission on Colleges |    1    |    15   |   5    | 26620 | 290 |     1089    | Huntsville |   AL  |        301 Sparkman Dr         |   35899    | 34.724557 | -86.640449 |
|     100724     |       Alabama State University      | Southern Association of Colleges and Schools Commission on Colleges |    1    |    17   |   5    | 33860 | 388 |     1101    | Montgomery |   AL  |      915 S Jackson Street      | 36104-0271 | 32.364317 | -86.295677 |
+----------------+-------------------------------------+---------------------------------------------------------------------+---------+---------+--------+-------+-----+-------------+------------+-------+--------------------------------+------------+-----------+------------+

In [20]:
%%sql
Select * FROM Institutions 
WHERE institution_id = 100654;

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

1 rows affected.

+----------------+--------------------------+---------------------------------------------------------------------+---------+---------+--------+-------+-----+-------------+--------+-------+----------------------+-------+-----------+------------+
| institution_id |           name           |                             accredagency                            | control | ccbasic | region |  csba | cba | county_fips |  city  | state |       address        |  zip  |  latitude | longitude  |
+----------------+--------------------------+---------------------------------------------------------------------+---------+---------+--------+-------+-----+-------------+--------+-------+----------------------+-------+-----------+------------+
|     100654     | Alabama A & M University | Southern Association of Colleges and Schools Commission on Colleges |    1    |    18   |   5    | 26620 | 290 |     1089    | Normal |   AL  | 4900 Meridian Street | 35762 | 34.783368 | -86.568502 |
+----------------+--------------------------+---------------------------------------------------------------------+---------+---------+--------+-------+-----+-------------+--------+-------+----------------------+-------+-----------+------------+

In [11]:
%%sql
SELECT * FROM Students LIMIT 5;

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

5 rows affected.

+----------------+------+----------+--------------+------+------+-------+
| institution_id | year | adm_rate | num_students | act  | cdr2 |  cdr3 |
+----------------+------+----------+--------------+------+------+-------+
|     100654     | 2022 |  0.716   |     5098     | 18.0 | None | 0.045 |
|     100663     | 2022 |  0.8854  |    13284     | 27.0 | None | 0.012 |
|     100690     | 2022 |   None   |     251      | None | None |  0.06 |
|     100706     | 2022 |  0.7367  |     7358     | 28.0 | None | 0.016 |
|     100724     | 2022 |  0.9799  |     3495     | 18.0 | None | 0.052 |
+----------------+------+----------+--------------+------+------+-------+

In [12]:
%%sql
SELECT * FROM Financials LIMIT 5;

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

5 rows affected.

+----------------+------+---------------+----------------+-----------------+---------+-----------+
| institution_id | year | tuitionfee_in | tuitionfee_out | tuitionfee_prog | tuitfte | avgfacsal |
+----------------+------+---------------+----------------+-----------------+---------+-----------+
|     100654     | 2022 |     10024     |     18634      |       None      |   9243  |    8779   |
|     100663     | 2022 |      8568     |     20400      |       None      |  11678  |   11590   |
|     100690     | 2022 |      None     |      None      |       None      |  14093  |    4672   |
|     100706     | 2022 |     11488     |     23884      |       None      |   8246  |    9820   |
|     100724     | 2022 |     11068     |     19396      |       None      |   8535  |    7701   |
+----------------+------+---------------+----------------+-----------------+---------+-----------+

In [15]:
%%sql
SELECT * FROM Academics LIMIT 5;

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

/opt/anaconda3/envs/DEsql/lib/python3.13/site-packages/sql/connection/connection.py:865: JupySQLRollbackPerformed: Found invalid transaction. JupySQL executed a ROLLBACK operation.
  warnings.warn(

5 rows affected.

+----------------+------+---------+---------+---------+
| institution_id | year | preddeg | highdeg | stufacr |
+----------------+------+---------+---------+---------+
|     100654     | 2022 |    3    |    4    |   18.0  |
|     100663     | 2022 |    3    |    4    |   19.0  |
|     100690     | 2022 |    3    |    4    |   13.0  |
|     100706     | 2022 |    3    |    4    |   19.0  |
|     100724     | 2022 |    3    |    4    |   13.0  |
+----------------+------+---------+---------+---------+

In [ ]:
%%sql
--- Find 5 institutions with lowest admission rate with over 5k students in 2022
SELECT
    i.institution_id, i.name, s.adm_rate, s.num_students
FROM Institutions AS i
JOIN Students AS s 
ON i.institution_id = s.institution_id
WHERE s.num_students > 5000 AND s.year = 2022
ORDER BY s.adm_rate ASC
LIMIT 5;

Running query in 'postgresql://agehr:***@debprodserver.postgres.database.azure.com:5432/agehr'

5 rows affected.

+----------------+---------------------------------------------+----------+--------------+
| institution_id |                     name                    | adm_rate | num_students |
+----------------+---------------------------------------------+----------+--------------+
|     243744     |             Stanford University             |  0.0395  |     7645     |
|     166027     |              Harvard University             |  0.0401  |     7938     |
|     190150     | Columbia University in the City of New York |  0.0413  |     8832     |
|     186131     |             Princeton University            |  0.0438  |     5236     |
|     130794     |               Yale University               |  0.0531  |     6535     |
+----------------+---------------------------------------------+----------+--------------+